using System.Collections.Generic;
using System.Linq;
using UnityEngine;

public struct RandomParamStruct
{
    public static readonly List<string> MaleNames = new(){"Дмитрий Исаев","Матвей Белых","Роман Шумилов","Николас Янушевский","Никита Нехаенко","Володя Спайси","Рамиль Габдрахманов", "Никита Лакин","Абдулкадир Карагишев","Егор Сечинский","Голд Голдич","Валентин Невский","Искандариос Искандариосич","Евгений Стеценко", "Агат Медояров", "Борис Лапин", "Вильгельм Гризли", "Гектор Сотников", "Даниил Пасечник", "Еремей Логов", "Захар Потапыч", "Игнат Барибал", "Кирилл Медведев", "Лев Кленов", "Максим Улейников", "Николай Топтыгин", "Олег Бортов", "Павел Бруин", "Родион Лесничий", "Семён Пушистов", "Тимофей Берестов", "Ульян Ханни", "Фёдор Косолапов", "Харитон Рябинин", "Ян Гумми", "Артемий Мишутин", "Богдан Кедров", "Вадим Бортников", "Глеб Бурмилов", "Дмитрий Когтев", "Евгений Черничный", "Игорь Бортников", "Константин Бурый", "Леонид Борей", "Мирон Каштанов", "Нестор Орехов", "Платон Ельников", "Руслан Шишкин", "Станислав Плюшев", "Тихон Лапишкин", "Феликс Овсянников", "Эдуард Вересков", "Юрий Барсуков", "Алексей Логовский", "Валентин Медный", "Виктор Бортягин", "Владислав Рябов", "Григорий Тополь", "Елисей Шершнев", "Зиновий Бороздин", "Клим Ежов", "Марат Кленников", "Никита Шелестов", "Остап Брусничный", "Прохор Лапшин", "Роман Медолюбов", "Савелий Пчельников", "Тарас Гнездов", "Фаддей Дуплянский", "Христофор Лесовик", "Эмиль Верескун", "Юлиан Пушистый", "Альберт Жаров", "Варфоломей Орехов", "Геннадий Бортовой", "Демьян Гречишников", "Ефрем Гудронов", "Зосима Ольхов", "Касьян Липкин", "Лаврентий Рябошапка", "Моисей Подлесный", "Никон Черносотенский", "Онуфрий Медоваров", "Порфирий Липовец", "Рубен Сотников", "Святослав Калужский", "Терентий Когтяр", "Фома Солодов", "Харлампий Прополисов", "Эраст Черничкин", "Юстин Медонес", "Анатолий Лесничев", "Бронислав Колосов", "Виссарион Пчельников", "Гавриил Бортняк", "Диомид Кедров", "Евсей Шерстяков", "Захарий Липкин", "Кузьма Орехов", "Леонтий Мишустин", "Мефодий Бурмилов", "Нифонт Чернозёмов", "Октябрь Медведов", "Пантелеймон Барибалов", "Ростислав Пасечников", "Сильвестр Гуммич", "Тимур Берестяков", "Феофан Логов", "Хрисанф Овсянников", "Эллий Косолапов", "Юрий Гризлов", "Архип Коготков", "Боголюб Лесков", "Виталий Мёдников"};
    public static readonly List<string> FemaleNames = new() {"Полина Польская","Елена Салий","Дарья Лакина", "Анна Ли","Агата Липкина", "Белла Орешникова", "Валентина Гризли", "Галина Медова", "Дарья Топтыгина", "Екатерина Лесничая", "Жанна Барсова", "Зинаида Пасечная", "Инна Шерстякова", "Кристина Бортникова", "Людмила Косолапова", "Марина Улейникова", "Наталья Кленникова", "Оксана Гнездова", "Полина Медведева", "Римма Черничкина", "Светлана Овсянникова", "Тамара Орехова", "Ульяна Барибалова", "Фаина Верескова", "Харита Пушистая", "Ярослава Логова", "Алиса Медонесова", "Богдана Лесова", "Влада Брусничная", "Гертруда Лапишина", "Диана Берестова", "Евгения Прополисова", "Жасмин Липовецкая", "Злата Чернозёмова", "Изабелла Лесковская", "Карина Бортнякова", "Лариса Ореховская", "Мира Пасечникова", "Нина Гризлиева", "Олеся Медоварова", "Пелагея Кедрова", "Регина Пчельникова", "Серафима Шершнева", "Татьяна Ольховская", "Устина Барсукова", "Федора Гудронова", "Христина Когтева", "Элеонора Плюшева", "Юлия Калужская", "Алёна Дуплянская", "Беатриса Солодова", "Варвара Медонина", "Глафира Черничникова", "Дина Лесовикова", "Ева Гризликовская", "Жозефина Верескович", "Зоряна Барибалова", "Ирина Орехович", "Клара Кленова", "Лилия Бортникова", "Марфа Липникова", "Надежда Медова", "Офелия Ольховская", "Патрисия Черносотенская", "Раиса Пасечникова", "Снежана Логова", "Теодора Пчельникова", "Устинья Гризлиева", "Филомена Лесович", "Хильда Прополисова", "Эмилия Орехова", "Юстина Калужская", "Аврора Бортякина", "Берта Черничникова", "Веста Медонина", "Гайя Медоварова", "Дарина Липова", "Елизавета Брусничная", "Жанетта Лапина", "Земфира Гнездова", "Ия Бортникова", "Камилла Пушистая", "Люция Верескова", "Мелания Ольховская", "Нонна Топтыгина", "Одетта Лесковская", "Психея Гудронова", "Розалия Барсукова", "Сильвия Овсянникова", "Тереза Берестова", "Уна Лапишина", "Фелицата Чернозёмова", "Хана Гризликова", "Эстер Лесова", "Юнона Медведева", "Анастасия Косолапова", "Бланка Логова", "Вероника Липова", "Грейс Пасечная", "Джульетта Пчельникова", "Евангелина Орехова" };
    public static readonly List<DialogConfig> RobotsReplics = Resources.LoadAll<DialogConfig>("Scriptable/HorrorNPC").ToList();
    public static readonly List<Sprite> Photos = Resources.LoadAll<Sprite>("BearPhotos").ToList();
    public static readonly List<DialogConfig> MaleConfigs = Resources.LoadAll<DialogConfig>("Scriptable/NormalNPC/Man").ToList();
    public static readonly List<DialogConfig> FemaleConfigs = Resources.LoadAll<DialogConfig>("Scriptable/NormalNPC/Woman").ToList();
    public static readonly List<DialogConfig> GeneralConfigs = Resources.LoadAll<DialogConfig>("Scriptable/NormalNPC/Other").ToList();
    public static readonly List<DialogConfig> TutorialConfigs = Resources.LoadAll<DialogConfig>("Scriptable/TutorialNPC").ToList();
    public static readonly List<Sprite> Stamps = new()
    {
        Resources.Load<Sprite>("Sprites/Planets/Medovia"),
        Resources.Load<Sprite>("Sprites/Planets/Medvezhegol"),
        Resources.Load<Sprite>("Sprites/Planets/Ursa"),
        Resources.Load<Sprite>("Sprites/Planets/Arctos"),
        Resources.Load<Sprite>("Sprites/Planets/Polaris"),
    };
}

public enum Planet
{
    Медовия, Медвежегол, Урса, Арктос, Полярис
}
